In [1]:
import numpy as np
import pandas as pd
frame = pd.DataFrame(np.random.randn(4,3), columns=list('bde'),
                            index=['Utah','Ohio','Texas','Oregon'])
frame

               b         d         e
Utah    1.435098 -0.677100  0.351089
Ohio    0.943191  1.229807  0.141756
Texas   0.585160  0.631318  0.792694
Oregon -0.552704  0.722179 -0.250603

In [2]:
np.abs(frame)

               b         d         e
Utah    1.435098  0.677100  0.351089
Ohio    0.943191  1.229807  0.141756
Texas   0.585160  0.631318  0.792694
Oregon  0.552704  0.722179  0.250603

In [3]:
frame['d'].min()

-0.6770998442238237

In [4]:
func = lambda x: x.max() - x.min()
func(frame)

b    1.987801
d    1.906907
e    1.043297
dtype: float64

In [5]:
frame.apply(func)

b    1.987801
d    1.906907
e    1.043297
dtype: float64

In [6]:
frame.apply(func,axis=1)

Utah      2.112197
Ohio      1.088051
Texas     0.207534
Oregon    1.274883
dtype: float64

In [7]:
frame.sort_index(axis=1,ascending=True)

               b         d         e
Utah    1.435098 -0.677100  0.351089
Ohio    0.943191  1.229807  0.141756
Texas   0.585160  0.631318  0.792694
Oregon -0.552704  0.722179 -0.250603

In [8]:
frame.sort_index(axis=1,ascending=False)

               e         d         b
Utah    0.351089 -0.677100  1.435098
Ohio    0.141756  1.229807  0.943191
Texas   0.792694  0.631318  0.585160
Oregon -0.250603  0.722179 -0.552704

In [9]:
frame.sort_index(axis=0,ascending=False)

               b         d         e
Utah    1.435098 -0.677100  0.351089
Texas   0.585160  0.631318  0.792694
Oregon -0.552704  0.722179 -0.250603
Ohio    0.943191  1.229807  0.141756

In [10]:
frame.sort_index(axis=0,ascending=True)

               b         d         e
Ohio    0.943191  1.229807  0.141756
Oregon -0.552704  0.722179 -0.250603
Texas   0.585160  0.631318  0.792694
Utah    1.435098 -0.677100  0.351089

In [11]:
frame.sort_values(by='b')

               b         d         e
Oregon -0.552704  0.722179 -0.250603
Texas   0.585160  0.631318  0.792694
Ohio    0.943191  1.229807  0.141756
Utah    1.435098 -0.677100  0.351089

In [12]:
frame.sort_values(by='b',ascending=False)

               b         d         e
Utah    1.435098 -0.677100  0.351089
Ohio    0.943191  1.229807  0.141756
Texas   0.585160  0.631318  0.792694
Oregon -0.552704  0.722179 -0.250603

In [13]:
frame.rank()

          b    d    e
Utah    4.0  1.0  3.0
Ohio    3.0  4.0  2.0
Texas   2.0  2.0  4.0
Oregon  1.0  3.0  1.0

In [14]:
frame.rank(axis=1)

          b    d    e
Utah    3.0  1.0  2.0
Ohio    2.0  3.0  1.0
Texas   1.0  2.0  3.0
Oregon  1.0  3.0  2.0

In [15]:
frame.sum()

b    2.410745
d    1.906204
e    1.034936
dtype: float64

In [16]:
frame.sum(axis="columns")

Utah      1.109087
Ohio      2.314754
Texas     2.009172
Oregon   -0.081127
dtype: float64

In [17]:
frame.mean()

b    0.602686
d    0.476551
e    0.258734
dtype: float64

In [18]:
frame['b'] = None

In [19]:
frame

           b         d         e
Utah    None -0.677100  0.351089
Ohio    None  1.229807  0.141756
Texas   None  0.631318  0.792694
Oregon  None  0.722179 -0.250603

In [20]:
frame.mean()

b         NaN
d    0.476551
e    0.258734
dtype: float64

In [21]:
frame.mean(axis=1)

Utah     -0.163005
Ohio      0.685781
Texas     0.712006
Oregon    0.235788
dtype: float64

In [22]:
frame.mean(axis=1,skipna=False)

Utah     -0.163005
Ohio      0.685781
Texas     0.712006
Oregon    0.235788
dtype: float64

In [23]:
frame.mean(axis=1,skipna=True)

Utah     -0.163005
Ohio      0.685781
Texas     0.712006
Oregon    0.235788
dtype: float64

In [24]:
frame['b'] = np.random.randn(4)

In [25]:
frame

               b         d         e
Utah    0.689575 -0.677100  0.351089
Ohio   -1.303067  1.229807  0.141756
Texas   1.194951  0.631318  0.792694
Oregon -0.002250  0.722179 -0.250603

In [26]:
frame['a'] = ""

In [27]:
frame

               b         d         e a
Utah    0.689575 -0.677100  0.351089
Ohio   -1.303067  1.229807  0.141756
Texas   1.194951  0.631318  0.792694
Oregon -0.002250  0.722179 -0.250603

In [28]:
frame.pop('a')

Utah
Ohio
Texas
Oregon
Name: a, dtype: object

In [29]:
frame

               b         d         e
Utah    0.689575 -0.677100  0.351089
Ohio   -1.303067  1.229807  0.141756
Texas   1.194951  0.631318  0.792694
Oregon -0.002250  0.722179 -0.250603

In [30]:
frame['b']['Utah'] = np.nan

In [31]:
frame

               b         d         e
Utah         NaN -0.677100  0.351089
Ohio   -1.303067  1.229807  0.141756
Texas   1.194951  0.631318  0.792694
Oregon -0.002250  0.722179 -0.250603

In [32]:
frame.mean(axis=1,skipna=True)

Utah     -0.163005
Ohio      0.022832
Texas     0.872988
Oregon    0.156442
dtype: float64

In [33]:
frame.mean(axis=1,skipna=False)

Utah           NaN
Ohio      0.022832
Texas     0.872988
Oregon    0.156442
dtype: float64

In [34]:
frame.loc[['Utah','Ohio'],['b','d']]

             b         d
Utah       NaN -0.677100
Ohio -1.303067  1.229807

In [35]:
frame.iloc[[2,3],[0,1]]

               b         d
Texas   1.194951  0.631318
Oregon -0.002250  0.722179

In [36]:
frame.iloc[:,:]

               b         d         e
Utah         NaN -0.677100  0.351089
Ohio   -1.303067  1.229807  0.141756
Texas   1.194951  0.631318  0.792694
Oregon -0.002250  0.722179 -0.250603

In [37]:
frame.iloc[:,:2]

               b         d
Utah         NaN -0.677100
Ohio   -1.303067  1.229807
Texas   1.194951  0.631318
Oregon -0.002250  0.722179

In [38]:
frame.drop('b',axis=1)

               d         e
Utah   -0.677100  0.351089
Ohio    1.229807  0.141756
Texas   0.631318  0.792694
Oregon  0.722179 -0.250603

In [39]:
frame.drop('b',axis=1,inplace=True)

In [40]:
frame

               d         e
Utah   -0.677100  0.351089
Ohio    1.229807  0.141756
Texas   0.631318  0.792694
Oregon  0.722179 -0.250603

In [41]:
frame['b'] = np.random.randn(4)

In [42]:
frame

               d         e         b
Utah   -0.677100  0.351089 -1.522976
Ohio    1.229807  0.141756  1.612765
Texas   0.631318  0.792694 -1.212184
Oregon  0.722179 -0.250603  0.460750

In [43]:
frame.drop('Utah',axis=0)

               d         e         b
Ohio    1.229807  0.141756  1.612765
Texas   0.631318  0.792694 -1.212184
Oregon  0.722179 -0.250603  0.460750

In [44]:
frame = pd.Series(['blue','green','red'],index=[0,3,6])
frame

0     blue
3    green
6      red
dtype: object

In [45]:
frame.reindex(range(9),method='ffill')

0     blue
1     blue
2     blue
3    green
4    green
5    green
6      red
7      red
8      red
dtype: object

In [46]:
frame.reindex(range(6),method='ffill')

0     blue
1     blue
2     blue
3    green
4    green
5    green
dtype: object

In [47]:
frame.reindex(range(12),method='ffill')

0      blue
1      blue
2      blue
3     green
4     green
5     green
6       red
7       red
8       red
9       red
10      red
11      red
dtype: object

In [48]:
frame.reindex(range(12))

0      blue
1       NaN
2       NaN
3     green
4       NaN
5       NaN
6       red
7       NaN
8       NaN
9       NaN
10      NaN
11      NaN
dtype: object

In [49]:
frame = pd.DataFrame(np.random.randn(4,3), columns=list('bde'),
                            index=range(4))
frame

          b         d         e
0 -0.200514 -1.078570  1.931126
1  0.918295  0.527441  0.057577
2 -1.322612 -0.991904 -0.484520
3  1.712114 -1.051839 -0.031281

In [50]:
frame.reindex(range(12))

           b         d         e
0  -0.200514 -1.078570  1.931126
1   0.918295  0.527441  0.057577
2  -1.322612 -0.991904 -0.484520
3   1.712114 -1.051839 -0.031281
4        NaN       NaN       NaN
5        NaN       NaN       NaN
6        NaN       NaN       NaN
7        NaN       NaN       NaN
8        NaN       NaN       NaN
9        NaN       NaN       NaN
10       NaN       NaN       NaN
11       NaN       NaN       NaN

In [51]:
frame.reindex(range(12),method='ffill')

           b         d         e
0  -0.200514 -1.078570  1.931126
1   0.918295  0.527441  0.057577
2  -1.322612 -0.991904 -0.484520
3   1.712114 -1.051839 -0.031281
4   1.712114 -1.051839 -0.031281
5   1.712114 -1.051839 -0.031281
6   1.712114 -1.051839 -0.031281
7   1.712114 -1.051839 -0.031281
8   1.712114 -1.051839 -0.031281
9   1.712114 -1.051839 -0.031281
10  1.712114 -1.051839 -0.031281
11  1.712114 -1.051839 -0.031281